; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (clear ?x)
               (on-table ?x)
               (arm-empty)
               (holding ?x)
               (on ?x ?y))

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
                 (not (arm-empty))))

  (:action putdown
    :parameters  (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
                 (not (holding ?ob))))

  (:action stack
    :parameters  (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
                 (not (clear ?underob)) (not (holding ?ob))))

  (:action unstack
    :parameters  (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
                 (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-22)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 )
(:init
(arm-empty)
(on-table b1)
(on b2 b21)
(on b3 b19)
(on b4 b5)
(on b5 b3)
(on-table b6)
(on-table b7)
(on-table b8)
(on b9 b7)
(on b10 b8)
(on-table b11)
(on b12 b20)
(on b13 b1)
(on b14 b18)
(on b15 b9)
(on b16 b22)
(on b17 b2)
(on b18 b10)
(on b19 b14)
(on b20 b11)
(on b21 b6)
(on b22 b13)
(clear b4)
(clear b12)
(clear b15)
(clear b16)
(clear b17)
)
(:goal
(and
(on b1 b6)
(on b2 b3)
(on b3 b9)
(on b4 b2)
(on b5 b1)
(on b6 b12)
(on b7 b15)
(on-table b8)
(on b9 b7)
(on b10 b16)
(on b11 b5)
(on b12 b10)
(on b13 b21)
(on b14 b4)
(on-table b15)
(on b16 b18)
(on b17 b8)
(on b18 b22)
(on-table b19)
(on b20 b11)
(on-table b21)
(on b22 b14))
)
)

; plan
1. (unstack b15 b9)
   deleted: (on b15 b9) (clear b15) (arm-empty)
   added: (holding b15) (clear b9)
   goals met: 3 of 22
2. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 22
3. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 3 of 22
4. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 22
5. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 3 of 22
6. (stack b7 b15)
   deleted: (clear b15) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b15)
   goals met: 4 of 22
7. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 4 of 22
8. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 5 of 22
9. (unstack b17 b2)
   deleted: (on b17 b2) (clear b17) (arm-empty)
   added: (holding b17) (clear b2)
   goals met: 5 of 22
10. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 5 of 22
11. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 5 of 22
12. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 22
13. (unstack b5 b3)
   deleted: (on b5 b3) (clear b5) (arm-empty)
   added: (holding b5) (clear b3)
   goals met: 6 of 22
14. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 22
15. (unstack b3 b19)
   deleted: (on b3 b19) (clear b3) (arm-empty)
   added: (holding b3) (clear b19)
   goals met: 6 of 22
16. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 7 of 22
17. (unstack b19 b14)
   deleted: (on b19 b14) (clear b19) (arm-empty)
   added: (holding b19) (clear b14)
   goals met: 7 of 22
18. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 8 of 22
19. (unstack b14 b18)
   deleted: (on b14 b18) (clear b14) (arm-empty)
   added: (holding b14) (clear b18)
   goals met: 8 of 22
20. (stack b14 b4)
   deleted: (clear b4) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b4)
   goals met: 9 of 22
21. (unstack b16 b22)
   deleted: (on b16 b22) (clear b16) (arm-empty)
   added: (holding b16) (clear b22)
   goals met: 9 of 22
22. (stack b16 b18)
   deleted: (clear b18) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b18)
   goals met: 10 of 22
23. (unstack b22 b13)
   deleted: (on b22 b13) (clear b22) (arm-empty)
   added: (holding b22) (clear b13)
   goals met: 10 of 22
24. (stack b22 b14)
   deleted: (clear b14) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b14)
   goals met: 11 of 22
25. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 11 of 22
26. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 11 of 22
27. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 11 of 22
28. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 12 of 22
29. (unstack b16 b18)
   deleted: (on b16 b18) (clear b16) (arm-empty)
   added: (holding b16) (clear b18)
   goals met: 11 of 22
30. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 11 of 22
31. (unstack b18 b10)
   deleted: (on b18 b10) (clear b18) (arm-empty)
   added: (holding b18) (clear b10)
   goals met: 11 of 22
32. (stack b18 b22)
   deleted: (clear b22) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b22)
   goals met: 12 of 22
33. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 12 of 22
34. (stack b16 b18)
   deleted: (clear b18) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b18)
   goals met: 13 of 22
35. (unstack b12 b20)
   deleted: (on b12 b20) (clear b12) (arm-empty)
   added: (holding b12) (clear b20)
   goals met: 13 of 22
36. (stack b12 b10)
   deleted: (clear b10) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b10)
   goals met: 14 of 22
37. (unstack b20 b11)
   deleted: (on b20 b11) (clear b20) (arm-empty)
   added: (holding b20) (clear b11)
   goals met: 13 of 22
38. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 13 of 22
39. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 13 of 22
40. (stack b11 b5)
   deleted: (clear b5) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b5)
   goals met: 14 of 22
41. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 14 of 22
42. (stack b20 b11)
   deleted: (clear b11) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b11)
   goals met: 15 of 22
43. (unstack b12 b10)
   deleted: (on b12 b10) (clear b12) (arm-empty)
   added: (holding b12) (clear b10)
   goals met: 14 of 22
44. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 14 of 22
45. (unstack b10 b8)
   deleted: (on b10 b8) (clear b10) (arm-empty)
   added: (holding b10) (clear b8)
   goals met: 14 of 22
46. (stack b10 b16)
   deleted: (clear b16) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b16)
   goals met: 15 of 22
47. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 15 of 22
48. (stack b17 b8)
   deleted: (clear b8) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b8)
   goals met: 16 of 22
49. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 16 of 22
50. (stack b12 b10)
   deleted: (clear b10) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b10)
   goals met: 17 of 22
51. (unstack b20 b11)
   deleted: (on b20 b11) (clear b20) (arm-empty)
   added: (holding b20) (clear b11)
   goals met: 16 of 22
52. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 16 of 22
53. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 15 of 22
54. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 15 of 22
55. (unstack b12 b10)
   deleted: (on b12 b10) (clear b12) (arm-empty)
   added: (holding b12) (clear b10)
   goals met: 14 of 22
56. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 14 of 22
57. (unstack b10 b16)
   deleted: (on b10 b16) (clear b10) (arm-empty)
   added: (holding b10) (clear b16)
   goals met: 13 of 22
58. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 13 of 22
59. (unstack b16 b18)
   deleted: (on b16 b18) (clear b16) (arm-empty)
   added: (holding b16) (clear b18)
   goals met: 12 of 22
60. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 12 of 22
61. (unstack b18 b22)
   deleted: (on b18 b22) (clear b18) (arm-empty)
   added: (holding b18) (clear b22)
   goals met: 11 of 22
62. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 11 of 22
63. (unstack b22 b14)
   deleted: (on b22 b14) (clear b22) (arm-empty)
   added: (holding b22) (clear b14)
   goals met: 10 of 22
64. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 10 of 22
65. (unstack b14 b4)
   deleted: (on b14 b4) (clear b14) (arm-empty)
   added: (holding b14) (clear b4)
   goals met: 9 of 22
66. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 9 of 22
67. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 8 of 22
68. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 8 of 22
69. (unstack b2 b21)
   deleted: (on b2 b21) (clear b2) (arm-empty)
   added: (holding b2) (clear b21)
   goals met: 8 of 22
70. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 9 of 22
71. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 9 of 22
72. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 10 of 22
73. (unstack b21 b6)
   deleted: (on b21 b6) (clear b21) (arm-empty)
   added: (holding b21) (clear b6)
   goals met: 10 of 22
74. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 11 of 22
75. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 11 of 22
76. (stack b14 b4)
   deleted: (clear b4) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b4)
   goals met: 12 of 22
77. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 12 of 22
78. (stack b22 b14)
   deleted: (clear b14) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b14)
   goals met: 13 of 22
79. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 13 of 22
80. (stack b6 b12)
   deleted: (clear b12) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b12)
   goals met: 14 of 22
81. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 14 of 22
82. (stack b20 b11)
   deleted: (clear b11) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b11)
   goals met: 15 of 22
83. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 15 of 22
84. (stack b18 b22)
   deleted: (clear b22) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b22)
   goals met: 16 of 22
85. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 16 of 22
86. (stack b16 b18)
   deleted: (clear b18) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b18)
   goals met: 17 of 22
87. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 17 of 22
88. (stack b13 b21)
   deleted: (clear b21) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b21)
   goals met: 18 of 22
89. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 18 of 22
90. (stack b10 b16)
   deleted: (clear b16) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b16)
   goals met: 19 of 22
91. (unstack b6 b12)
   deleted: (on b6 b12) (clear b6) (arm-empty)
   added: (holding b6) (clear b12)
   goals met: 18 of 22
92. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 18 of 22
93. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 18 of 22
94. (stack b12 b10)
   deleted: (clear b10) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b10)
   goals met: 19 of 22
95. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 19 of 22
96. (stack b6 b12)
   deleted: (clear b12) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b12)
   goals met: 20 of 22
97. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 19 of 22
98. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 19 of 22
99. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 19 of 22
100. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 20 of 22
101. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 20 of 22
102. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 21 of 22
103. (unstack b20 b11)
   deleted: (on b20 b11) (clear b20) (arm-empty)
   added: (holding b20) (clear b11)
   goals met: 20 of 22
104. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 20 of 22
105. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 20 of 22
106. (stack b11 b5)
   deleted: (clear b5) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b5)
   goals met: 21 of 22
107. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 21 of 22
108. (stack b20 b11)
   deleted: (clear b11) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b11)
   goals met: 22 of 22
